scripts/load/artillery/500-reconnect-wave.yml
config:
  target: "{{ $processEnvironment.ARTILLERY_HTTP_TARGET }}"
  phases:
    - duration: "{{ $processEnvironment.ARTILLERY_RAMP_SECONDS }}"
      arrivalCount: "{{ $processEnvironment.ARTILLERY_MAX_VUS }}"
      maxVusers: "{{ $processEnvironment.ARTILLERY_MAX_VUS }}"
      name: reconnect-wave
  processor: "./processor.mjs"
  plugins:
    expect: {}

scenarios:
  - name: participant-reconnect-wave
    flow:
      - function: joinSession
      - function: connectParticipantStatusWs
      - think: 1
      - function: disconnectParticipantStatusWs
      - think: 0.25
      - function: reconnectParticipantStatusWs
      - think: 1
      - function: waitForReconnectResultsPhase
      - function: assertReconnectResultsSeen
      - think: 1
      - function: disconnectParticipantStatusWs